{
  "profile": {
    "First Name": "Marcelo",
    "Last Name": "Solórzano Astorga",
    "Maiden Name": "",
    "Address": "",
    "Birth Date": "",
    "Headline": "Software Developer",
    "Summary": "As a child, I loved writing stories; now, I channel that creativity into writing code. I am a software engineer with 5+ years of experience contributing to the design and development of high-performance, user-centric applications that deliver value.  I have discovered a deep passion for mobile and web development, which has become a central focus of my career. Along the way, I’ve embraced opportunities to switch between roles, challenging me to adapt to different programming paradigms. These experiences have provided me with a broader understanding of how different technologies and architectural solutions integrate to create cohesive systems.  In my spare time, I dedicate myself to developing video games, leveraging my technical background to turn ideas into reality. This year, I am excited to release my first game, with details soon to be announced—stay tuned!",
    "Industry": "Software Development",
    "Zip Code": "",
    "Geo Location": "San Jose, Costa Rica",
    "Twitter Handles": "",
    "Websites": "",
    "Instant Messengers": ""
  },
  "positions": [
    {
      "Company Name": "SOIN",
      "Title": "Mid Software Developer",
      "Description": "A full stack developer for the labs department of SOIN. Acting as a Tech Lead for TramiteYA, an innovative platform designed to drive digital transformation. TDCar, CrearEmpresa and DGME rely on TramiteYA to revolutionize and streamline procedure handling and tracking through a cutting-edge digital solution. • Continuously develop new features and enhancements for TramiteYA using JavaScript, Node.js and React. • Offer technical support to users of TramiteYA, addressing issues and troubleshooting problems to ensure smooth operation of the platform. • Lead innovation processes within the development team and estimate the time and resources required for new developments of features. • Use Git and GitHub for version control, managing code changes and collaborating with other developers. • Responsible for and actively participate in the deployment process of delivering new product features to production, collaborating closely with DevOps and release management teams.",
      "Location": "San Jose, Costa Rica",
      "Started On": "Mar 2024",
      "Finished On": "Oct 2024"
    },
    {
      "Company Name": "SOIN",
      "Title": "Mobile Mid Staff Developer",
      "Description": "A mobile developer for the labs department of SOIN, the innovative R&D branch of the company. • Develop new features and give support to Tapp: a proprietary mobile application to boost customer retention by providing businesses an out of the box loyalty program experience. • Attend and prepare conferences about technology breakthroughs to stay posted about the latest trends. • Be prepared to tackle projects on either Android or iOS. • Research and adapt to cutting edge mobile app development approaches: Kotlin, Flutter. • Maintain great communication with the design team to achieve the best design withouth compromising functionality. • Mantain good version control habits: branching, tagging, descriptive commits, pull requests, forks, remotes. • Build continuos integration processes and proactivelly improve them in order to automate repetitive application building processes.",
      "Location": "San Jose, Costa Rica",
      "Started On": "Mar 2021",
      "Finished On": "Mar 2024"
    },
    {
      "Company Name": "SOIN",
      "Title": "Junior Software Developer",
      "Description": "An Android developer for the health department of SOIN, a company with over 30 years of experience developing tecnology solutions. • Develop new features and give support to EDUS: a mobile application owned by Caja Costarricense del Seguro Social (CCSS) made available by the government nationwide in order to facilitate access to health record and other public health services. • Develop new features and give support to SIFF: an internal mobile application owned by CCSS developed exclusively for tablets to record public health related information and generate a census of the country condition. • Maintain great communication with the design team to achieve the best design withouth compromising functionality. • Work as an outsourcing partner: stay in constant communication and deliver good solutions designed to fit even with external developers. • Mantain good version control habits: branching, tagging, descriptive commits, pull requests, forks, remotes. • Build continuos integration processes and proactivelly improve them in order to automate repetitive application building processes. • Actively use tools to scan for applications bugs or code scanning to improve accessibility, security, performance and usability. • Write descriptive and concise external documentation of application architecture, methods calls and user flow.",
      "Location": "San Jose, Costa Rica",
      "Started On": "Sep 2019",
      "Finished On": "Mar 2021"
    },
    {
      "Company Name": "Manatí",
      "Title": "Manatí + MyPlanet Fellowship",
      "Description": "Completed the 2019 Fellowship program, hosted and operated by Manatí in partnership with Myplanet.  A fullservice digital agency in Costa Rica combined efforts with a software studio based in Toronto to put together a program where we learned and put to practice: • Agile practices, Scrum, backlogs, definition of done, priorization. • Web development frontend fundamentals: HTML5, CSS3. • Drupal 101: introduction, backend development, custom modules, theming, headless, REST API configuration and fundamentals. • React 101: server side vs client side, rendering, structure, const, let, maps, objects, props.  To deliver a fully functional proposal for a home page of a non profit organization named TeenSmart International.",
      "Location": "Costa Rica",
      "Started On": "Jun 2019",
      "Finished On": "Jul 2019"
    },
    {
      "Company Name": "Trambia",
      "Title": "Frontend Web Developer",
      "Description": "Part of the web development team of Trambia, the first company in Central America to become a Silver Partner of HubSpot in less than 6 months, responsible for: • Develop and implement code and front-end web design. • Work on multiple projects and comply with deadlines. • Write clean and elegant code. • Make wireframes or mock-ups of new and existing websites. • Thrive in an atmosphere of constant change with new technologies.",
      "Location": "Costa Rica",
      "Started On": "Feb 2019",
      "Finished On": "Apr 2019"
    }
  ],
  "skills": [
    "REST APIs",
    "Kanban",
    "Scrum",
    "PostgreSQL",
    "Amazon Web Services (AWS)",
    "React.js",
    "Java",
    "C++",
    "C#",
    "Python",
    "Web Development",
    "HTML",
    "Cascading Style Sheets (CSS)",
    "PHP",
    "Foundation Framework",
    "Bootstrap",
    "JavaScript",
    "Express.js",
    "AngularJS",
    "Node.js",
    "Mobile Application Development",
    "Android",
    "Augmented Reality",
    "SQL",
    "Transact-SQL (T-SQL)",
    "PL/SQL",
    "NoSQL",
    "MongoDB",
    "CouchDB",
    "Spatial Databases",
    "Data Warehousing",
    "SQL Server Integration Services (SSIS)",
    "Extract, Transform, Load (ETL)",
    "Game Development",
    "Unity3D",
    "Assembly Language",
    "Prolog",
    "Lisp",
    "NetLogo",
    "Project Management",
    "Blender",
    "Agile Methodologies",
    "Git",
    "Containerization",
    "Docker Products"
  ]
}